Revit 2027 API
View.CanBePrinted Property
Test whether the view can be printed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBePrinted { get; }
Public ReadOnly Property CanBePrinted As Boolean
	Get
public:
property bool CanBePrinted {
	bool get ();
}
member CanBePrinted : bool with get
Property Value
Boolean
See Also
Reference
View Class
Autodesk.Revit.DB Namespace